module IM
    #(parameter ADR_8 = 8, ADR_5 = 5, BIT_D = 32)
    (
        input   [31:0]     adr_im,
        
        output [BIT_D-1:0]  instr_im   
    );
    
    // IM
    //     разр€д       кол-во слов
    reg [BIT_D-1:0] RAM [0:BIT_D-1];    // создать пам€ть из 32-ти 32-битных €чеек
    initial $readmemh("ram.txt", RAM);  // readmemh - д€л считывание 16й системы, readmemb д€л считывани€ 2й системы
    
    assign instr_im = RAM[adr_im / 4];   // реализаци€ порта на чтение (передает 32-х битное слово (инструкцию))
    //  получатель (вых) <- отправитель (вх)
     
     
endmodule



/*
add 00000001010010011000100100110011
sub 01000000011100110000001010110011
addi 00000000010101001000010000010011
lw 00000110101010011010001110000011
sw 11111110011110011010110100100011
beq 00000001111001000000100001100011

0x00300113
0x00500193
0x00700213
0x00700293
0x00229663
0x00100313
0x0280006F
0x00000313
0x00329663
0x00100313
0x0180006F
0x00000313
0x00429663
0x00100313
0x0080006F
0x00000313
*/